Repository: zimai1992/my-firebase-app
Catalog: lib/l10n/app_*.arb
Languages: ms, zh

source: Add Medicine
ms: Tambah Ubat
zh: 添加药物

source: Medicine Name
ms: Nama Ubat
zh: 药物名称

# medicine_dosage
source: Dosage (e.g., 500mg, 1 tablet)
ms: Dos (cth., 500mg, 1 biji)
zh: 剂量（例如，500mg，1片）

# medicine_frequency
source: Frequency
ms: Kekerapan
zh: 频率

# special_instructions
source: Special Instructions (e.g., take with food)
ms: Arahan Khas (cth., ambil dengan makanan)
zh: 特别说明（例如，随餐服用）

# verification_prompt
source: I have verified the medicine name, dosage, and frequency with a healthcare professional.
ms: Saya telah mengesahkan nama ubat, dos, dan kekerapan dengan profesional penjagaan kesihatan.
zh: 我已经与医疗专业人员核实了药物名称、剂量和频率。

# please_enter_name
source: Please enter a medicine name
ms: Sila masukkan nama ubat
zh: 请输入药物名称

# please_enter_dosage
source: Please enter a dosage
ms: Sila masukkan dos
zh: 请输入剂量

# please_select_frequency
source: Please select a frequency
ms: Sila pilih kekerapan
zh: 请选择频率

source: Select Frequency
ms: Pilih Kekerapan
zh: 选择频率

# frequency_daily
source: Daily
ms: Harian
zh: 每天

# frequency_weekly
source: Weekly
ms: Mingguan
zh: 每周

# frequency_monthly
source: Monthly
ms: Bulanan
zh: 每月

source: Schedule Timings
ms: Masa Jadual
zh: 时间安排

source: Evenly Spaced
ms: Jarak Sekata
zh: 均匀间隔

source: Pick Times
ms: Pilih Masa
zh: 选择时间

# scheduled_at
source: Scheduled at: {times}
ms: Dijadualkan pada: {times}
zh: 安排在: {times}

# time_header
source: Time {index}
ms: Masa {index}
zh: 时间 {index}

source: Save Changes
ms: Simpan Perubahan
zh: 保存更改

source: Cancel
ms: Batal
zh: 取消

# times_a_day
source: {count} times a day
ms: {count} kali sehari
zh: 每天 {count} 次

# every_x_days
source: Every {count} days
ms: Setiap {count} hari
zh: 每 {count} 天

# specific_days_of_week
source: Specific days of the week
ms: Hari tertentu dalam seminggu
zh: 每周的特定日期

# specific_dates_of_month
source: Specific dates of the month
ms: Tarikh tertentu dalam sebulan
zh: 每月的特定日期

source: Times
ms: Masa
zh: 时间

source: Count
ms: Kiraan
zh: 次数

source: Interval
ms: Selang
zh: 间隔

source: OK
zh: 确定

source: Home
ms: Laman Utama
zh: 首页

source: History
ms: Sejarah
zh: 历史

source: Settings
ms: Tetapan
zh: 设置

# confirm_delete
source: Are you sure you want to delete this medicine?
ms: Adakah anda pasti mahu memadam ubat ini?
zh: 您确定要删除此药物吗？

source: Delete
ms: Padam
zh: 删除

source: Edit Medicine
ms: Edit Ubat
zh: 编辑药物

source: How many times?
ms: Berapa kali?
zh: 几次？

source: How often?
ms: Berapa kerap?
zh: 多久一次？

# save_button
source: Save
ms: Simpan
zh: 保存

# verify_title
source: Verify Information
ms: Sahkan Maklumat
zh: 核实信息

# pharmacist_note
source: Pharmacist's Note
ms: Nota Ahli Farmasi
zh: 药剂师说明

# upgrade_appbar_title
source: Upgrade
ms: Naik Taraf
zh: 升级

# premium_icon_label
source: PREMIUM
zh: 高级版

# upgrade_to_pro_title
source: Upgrade to Pro
ms: Naik Taraf ke Pro
zh: 升级到 Pro

# upgrade_to_pro_subtitle
source: Unlock all features and get the best experience.
ms: Nyahkunci semua ciri dan dapatkan pengalaman terbaik.
zh: 解锁所有功能，获得最佳体验。

# feature_unlimited_medicines
source: Unlimited Medicines
ms: Ubat Tanpa Had
zh: 无限药物管理

# feature_export_reports
source: Export Reports
ms: Eksport Laporan
zh: 导出报告

# feature_family_profiles
source: Family Profiles
ms: Profil Keluarga
zh: 家庭档案

# plan_monthly
source: Monthly
ms: Bulanan
zh: 月度

# per_month
source: /month
ms: /bulan
zh: /月

# plan_yearly
source: Yearly
ms: Tahunan
zh: 年度

# save_20_percent
source: Save 20%
ms: Jimat 20%
zh: 节省 20%

# subscribe_button_label
source: Subscribe Now
ms: Langgan Sekarang
zh: 立即订阅

# subscribed_to_premium
source: You are already subscribed to premium.
ms: Anda sudah melanggan premium.
zh: 您已订阅高级版。

# subscribe_now
source: Subscribe
ms: Langgan
zh: 订阅

# restore_purchases_button_label
source: Restore Purchases
ms: Pulihkan Pembelian
zh: 恢复购买

source: Restore Purchases
ms: Pulihkan Pembelian
zh: 恢复购买

# popular_plan_label
source: Popular
zh: 热门

# selected_plan_label
source: Selected
ms: Dipilih
zh: 已选择

source: Popular
zh: 热门

# language_english
source: English
ms: Inggeris
zh: 英语

# language_malay
source: Malay
ms: Bahasa Melayu
zh: 马来语

# language_chinese
source: Chinese
ms: Cina
zh: 中文

# settings_title
source: Settings
ms: Tetapan
zh: 设置

# language_section_title
source: Language
ms: Bahasa
zh: 语言

# tour_page_1_title
source: Welcome to your personal medical assistant!
ms: Selamat datang ke pembantu perubatan peribadi anda!
zh: 欢迎使用您的个人医疗助手！

# tour_page_1_description
source: Easily add and manage your medications. Set reminders so you never miss a dose.
ms: Tambah dan urus ubat anda dengan mudah. Tetapkan peringatan supaya anda tidak terlepas dos.
zh: 轻松添加和管理您的药物。设置提醒，以免错过任何剂量。

# tour_page_2_title
source: Track your progress
ms: Jejaki kemajuan anda
zh: 跟踪您的进度

# tour_page_2_description
source: Keep a log of your medication history. See what you have taken and when.
ms: Simpan log sejarah perubatan anda. Lihat apa yang anda telah ambil dan bila.
zh: 记录您的用药历史。查看您在何时服用了什么药物。

# tour_page_3_title
source: Stay on top of your health
ms: Sentiasa menjaga kesihatan anda
zh: 关注您的健康

# tour_page_3_description
source: Get insights into your medication adherence and share reports with your doctor.
ms: Dapatkan cerapan tentang pematuhan ubat anda dan kongsi laporan dengan doktor anda.
zh: 深入了解您的用药依从性，并与您的医生分享报告。

# get_started_button
source: Get Started
ms: Mulakan
zh: 开始使用

source: Lifestyle Warnings
ms: Amaran Gaya Hidup
zh: 生活方式警告

# level_label
source: LEVEL
ms: TAHAP
zh: 等级

# to_level_x
source: {percent}% to Level {level}
ms: {percent}% ke Tahap {level}
zh: 距离第 {level} 级还有 {percent}%

# tier_seedling
source: Seedling
ms: Anak Benih
zh: 幼苗

# tier_guardian
source: Adherence Guardian
ms: Penjaga Kepatuhan
zh: 准守卫者

# tier_hero
source: Adherence Hero
ms: Wira Kepatuhan
zh: 准守英雄

# tier_sentinel
source: Diamond Sentinel
ms: Sentinel Berlian
zh: 钻石哨兵

# tier_immortal
source: Adherence Immortal
ms: Abadi Kepatuhan
zh: 准守永生者

# oracle_title
source: THE CLINICAL ORACLE
ms: ORACLE KLINIKAL
zh: 临床先知

# oracle_description
source: Unlock advanced longitudinal pattern detection. (Requires Premium & Level 50+)
ms: Buka kunci pengesanan corak longitud termaju. (Memerlukan Premium & Tahap 50+)
zh: 解锁先进的纵向模式检测。（需要高级版和 50 级以上）

# oracle_button
source: CONSULT THE ORACLE
ms: RUNDING DENGAN ORACLE
zh: 咨询先知

# premium_required
source: The Clinical Oracle requires a Premium subscription.
ms: Oracle Klinikal memerlukan langganan Premium.
zh: 临床先知需要高级版订阅。

# immortal_required
source: The Clinical Oracle is only accessible to 'Adherence Immortals' (Level 50+). Keep taking your medicine to unlock!
ms: Oracle Klinikal hanya boleh diakses oleh "Abadi Kepatuhan" (Tahap 50+). Teruskan mengambil ubat anda untuk membuka kunci!
zh: 只有“准守永生者”（50 级以上）才能访问临床先知。继续服药以解锁！

source: Oracle Insights
ms: Wawasan Oracle
zh: 先知洞察

# oracle_empty
source: The Oracle is silent. Insufficient data for deep analysis.
ms: Oracle senyap. Data tidak mencukupi untuk analisis mendalam.
zh: 先知保持沉默。数据不足，无法进行深度分析。

# oracle_error
source: Oracle Sync Failure: High-fidelity pattern analysis requires more consistent data logging.
ms: Kegagalan Penyegerakan Oracle: Analisis corak kesetiaan tinggi memerlukan log data yang lebih konsisten.
zh: 先知同步失败：高保真模式分析需要更一致的数据记录。

# missed_label
source: MISSED
ms: TERLEPAS
zh: 已错过

# filter_all
source: All
ms: Semua
zh: 全部

# filter_missed
source: Missed Only
ms: Terlepas Sahaja
zh: 仅限错过

source: Reading Saved
ms: Bacaan Disimpan
zh: 读取已保存

source: Health Alert
ms: Amaran Kesihatan
zh: 健康警报

source: Health Vitals
ms: Vital Kesihatan
zh: 健康体征

source: Add New Reading
ms: Tambah Bacaan Baharu
zh: 添加新记录

source: SAVE RECORD
ms: SIMPAN REKOD
zh: 保存记录

source: RECENT HISTORY
ms: SEJARAH TERKINI
zh: 最近历史

# entries_count
source: {count} Entries
ms: {count} Entri
zh: {count} 条记录

# no_readings_yet
source: No readings recorded yet
ms: Tiada bacaan direkodkan lagi
zh: 尚未记录任何读数

source: Missed Dose Guide
ms: Panduan Dos Terlepas
zh: 漏服药物指南

# what_to_do_late
source: WHAT TO DO IF > 2 HOURS LATE
ms: APA PERLU DIBUAT JIKA > 2 JAM LEWAT
zh: 如果超过 2 小时未服药该怎么办

source: Safe Window
ms: Window Selamat
zh: 安全窗口

source: CLINICAL REFERENCES
ms: RUJUKAN KLINIKAL
zh: 临床参考文献

source: Upgrade to Premium
ms: Naik Taraf ke Premium
zh: 升级到高级版

source: Maybe Later
ms: Mungkin Kemudian
zh: 以后再说

source: View Plans
ms: Lihat Pelan
zh: 查看计划

source: AI Pharmacist
ms: Ahli Farmasi AI
zh: AI 药剂师

# typing_indicator
source: Typing...
ms: Menaip...
zh: 正在输入...

source: Premium Feature
ms: Ciri Premium
zh: 高级功能

# pro_label
source: PRO
zh: 专业版

source: Share Data
ms: Kongsi Data
zh: 分享数据

# caregiver_code_label
source: Your unique caregiver code:
ms: Kod penjaga unik anda:
zh: 您的唯一护理人员代码：

source: Copy Code
ms: Salin Kod
zh: 复制代码

source: Close
ms: Tutup
zh: 关闭

# guest_login
source: Continue as Guest
ms: Teruskan sebagai Tetamu
zh: 以游客身份继续

# error_parsing_med
source: Error parsing medication information.
ms: Ralat menghuraikan maklumat ubat.
zh: 解析药物信息时出错。

source: HEALTH ADHERENCE REPORT
ms: LAPORAN PEMATUHAN KESIHATAN
zh: 健康依从性报告

# generated_by_ai
source: Generated by AI Medication Manager
ms: Dijana oleh Pengurus Ubat AI
zh: 由 AI 药物管理器生成

# page_info
source: Page {current} of {total}
ms: Halaman {current} daripada {total}
zh: 第 {current} 页，共 {total} 页

# patient_info
source: PATIENT INFORMATION
ms: MAKLUMAT PESAKIT
zh: 患者信息

# report_period
source: Report Period: Last 30 Days
ms: Tempoh Laporan: 30 Hari Terakhir
zh: 报告期：最近 30 天

source: Overall Adherence
ms: Pematuhan Keseluruhan
zh: 总体依从性

source: MEDICATION SUMMARY
ms: RINGKASAN UBAT
zh: 用药摘要

source: HEALTH VITAL READINGS
ms: BACAAN VITAL KESIHATAN
zh: 健康体征记录

source: RECENT DOSAGE LOGS
ms: LOG DOS TERKINI
zh: 最近服药记录

# ai_clinical_summary
source: AI CLINICAL SUMMARY (BY GEMINI)
ms: RINGKASAN KLINIKAL AI (OLEH GEMINI)
zh: AI 临床摘要（由 GEMINI 提供）

source: Clinician Review Recommended
ms: Semakan Klinikal Disyorkan
zh: 建议临床医生审核

source: Clinical Report
ms: Laporan Klinikal
zh: 临床报告

# generate_pdf
source: GENERATE PDF REPORT
ms: JANA LAPORAN PDF
zh: 生成 PDF 报告

# analyzing_patterns
source: Gemini is analyzing health patterns...
ms: Gemini sedang menganalisis corak kesihatan...
zh: Gemini 正在分析健康模式...

source: DONE
ms: SELESAI
zh: 完成

# oracle_sync_error
source: Oracle sync failed: {error}
ms: Kegagalan penyegerakan Oracle: {error}
zh: 先知同步失败：{error}

source: Systolic
ms: Sistolik
zh: 收缩压

source: Diastolic
ms: Diastolik
zh: 舒张压

source: Glucose (Sugar)
ms: Glukosa (Gula)
zh: 血糖

source: Blood Pressure
ms: Tekanan Darah
zh: 血压

source: INR (Warfarin)
zh: 国际标准化比值 (华法林)

# unit_ratio
source: Ratio
ms: Nisbah
zh: 比率

# abnormal_glucose
source: Abnormal Glucose Level. Please consult a doctor immediately.
ms: Tahap Glukosa Tidak Normal. Sila rujuk doktor dengan segera.
zh: 血糖水平异常。请立即咨询医生。

# inr_out_of_range
source: INR out of range (Target 2.0-3.0 usually). Check with your doctor!
ms: INR di luar julat (Sasaran biasanya 2.0-3.0). Periksa dengan doktor anda!
zh: INR 超出范围（目标通常为 2.0-3.0）。请咨询您的医生！

source: Share Report
ms: Kongsi Laporan
zh: 分享报告

source: My Health Report
ms: Laporan Kesihatan Saya
zh: 我的健康报告

# filter_label
source: Filter:
ms: Penapis:
zh: 筛选：

# no_missed_doses
source: No missed doses recorded.
ms: Tiada dos terlepas direkodkan.
zh: 无错过剂量记录。

# no_history
source: No history yet.
ms: Tiada sejarah lagi.
zh: 暂无记录。

# free_tier_history_note
source: Free tier shows last 7 days. Upgrade to see full history.
ms: Tahap percuma menunjukkan 7 hari terakhir. Naik taraf untuk melihat sejarah penuh.
zh: 免费版显示最近 7 天。升级以查看完整历史记录。

source: Appearance & Language
ms: Penampilan & Bahasa
zh: 外观与语言

source: Dark Mode
ms: Mod Gelap
zh: 深色模式

source: Health Support
ms: Sokongan Kesihatan
zh: 健康支持

# doctor_report_title
source: Doctor Report
ms: Laporan Doktor
zh: 医生报告

# doctor_report_subtitle
source: Generate a medication history PDF
ms: Jana PDF sejarah perubatan
zh: 生成用药历史 PDF

# share_data_title
source: Share My Data
ms: Kongsi Data Saya
zh: 分享我的数据

# share_data_subtitle
source: Link with a caregiver
ms: Pautkan dengan penjaga
zh: 关联护理人员

# monitoring_section
source: Monitoring
ms: Pemantauan
zh: 监控

# caregiver_access_title
source: Caregiver Access
ms: Akses Penjaga
zh: 护理人员访问

# caregiver_access_subtitle
source: Monitor someone else's health
ms: Pantau kesihatan orang lain
zh: 监控他人的健康状况

# account_section
source: Account
ms: Akaun
zh: 账户

source: Sign Out
ms: Log Keluar
zh: 退出登录

# premium_required_desc
source: {feature} is only available to premium subscribers. Upgrade to get full access to AI health insights, voice commands, and reports.
ms: {feature} hanya tersedia untuk pelanggan premium. Naik taraf untuk mendapatkan akses penuh kepada cerapan kesihatan AI, arahan suara dan laporan.
zh: “{feature}”仅适用于高级订阅者。升级后可获得 AI 健康洞察、语音命令和报告的完整访问权限。

# guest_email
source: No email linked
ms: Tiada e-mel dipautkan
zh: 未关联电子邮件

source: My Profile
ms: Profil Saya
zh: 我的个人资料

# caregiver_code_desc
source: Share this code with your caregiver to allow them to monitor your health in real-time.
ms: Kongsi kod ini dengan penjaga anda untuk membolehkan mereka memantau kesihatan anda dalam masa nyata.
zh: 将此代码分享给您的护理人员，以便他们实时监控您的健康状况。

# missed_dose_guide_title
source: Missed Dose Guide
ms: Panduan Dos Terlepas
zh: 漏服剂量指南

# od_title
source: Once Daily (OD)
ms: Sekali Sehari (OD)
zh: 每日一次 (OD)

# od_protocol
source: Take the missed dose as soon as it is remembered, up to 8 hours late. After 8 hours, skip the dose and wait for your next scheduled time.
ms: Ambil dos yang terlepas sebaik sahaja diingat, sehingga 8 jam lewat. Selepas 8 jam, langkau dos dan tunggu masa jadual seterusnya.
zh: 想起时立即补服，最多延迟 8 小时。 超过 8 小时后，请跳过该剂量，等待下一次预定时间。

# multiple_times_title
source: Multiple Times a Day
ms: Beberapa Kali Sehari
zh: 每日多次

# multiple_times_protocol
source: If more than 2 hours late, skip the missed dose and wait until the next dose is due. Do not double your dose to catch up.
ms: Jika lebih daripada 2 jam lewat, langkau dos yang terlepas dan tunggu sehingga dos seterusnya. Jangan gandakan dos anda untuk mengejar semula.
zh: 如果延迟超过 2 小时，请跳过漏服的剂量，等待下一次剂量。 不要为了补服而加倍剂量。

# side_effects_title
source: Side Effects
ms: Kesan Sampingan
zh: 副作用

# side_effects_protocol
source: Monitor for side effects, as these may be increased if the dosing interval is shorter.
ms: Pantau kesan sampingan, kerana ini mungkin meningkat jika selang dos lebih pendek.
zh: 监测副作用，因为如果给药间隔缩短，副作用可能会增加。

# meals_food_title
source: Meals & Food
ms: Makanan & Hidangan
zh: 膳食与食物

# meals_food_protocol
source: You can usually ignore warnings about taking the medicine with or without meals, unless there’s a significant risk of serious side-effects.
ms: Anda biasanya boleh mengabaikan amaran tentang pengambilan ubat dengan atau tanpa makanan, melainkan terdapat risiko serius kesan sampingan yang ketara.
zh: 除非存在严重副作用的风险，否则通常可以忽略关于随餐或空腹服药的警告。

# forgiveness_title
source: Medication "Forgiveness"
ms: "Kemaafan" Ubat
zh: 药物“宽恕度”

# forgiveness_protocol
source: Scientifically, "forgiveness" describes how much your medicine protects you after a missed dose. • Forgiving: Aspirin, Amlodipine (long-acting effects). • Unforgiving: Blood thinners (Rivaroxaban), Epilepsy meds, and Contraceptives. These require strict timing.
ms: Secara saintifik, "kemaafan" menerangkan sejauh mana ubat anda melindungi anda selepas dos yang terlepas. • Memaafkan: Aspirin, Amlodipine (kesan tahan lama). • Tidak Memaafkan: Pencair darah (Rivaroxaban), ubat Epilepsi, dan Perancang Kehamilan. Ini memerlukan ketepatan masa yang ketat.
zh: 科学上，“宽恕度”描述了漏服后药物对您的保护程度。 • 宽恕型：阿司匹林、氨氯地平（长效作用）。 • 不宽恕型：血液稀释剂（利伐沙班）、癫痫药物和避孕药。这些需要严格的时间控制。

# safe_window_title
source: Safe Window
ms: Tingkap Selamat
zh: 安全窗口

# safe_window_protocol
source: Once Daily (OD): You can take your dose up to 8 hours late. Others: 2 hours strictly.
ms: Sekali Sehari (OD): Anda boleh mengambil dos anda sehingga 8 jam lewat. Lain-lain: 2 jam dengan ketat.
zh: 每日一次 (OD)：您最多可以延迟 8 小时服药。其他：严格限制在 2 小时内。

# caregiver_hub_title
source: Caregiver Hub
ms: Hab Penjaga
zh: 护理中心

# caregiver_login_prompt
source: Please login to continue.
ms: Sila log masuk untuk meneruskan.
zh: 请登录以继续。

# caregiver_dashboard
source: Monitoring Dashboard
ms: Papan Pemuka Pemantauan
zh: 监控仪表板

# caregiver_dashboard_desc
source: Ensuring loved ones stay on track with their health.
ms: Memastikan orang tersayang kekal sihat.
zh: 确保亲人的健康步入正轨。

source: Pending Invitations
ms: Jemputan Tertunda
zh: 待处理邀请

source: Your Patients
ms: Pesakit Anda
zh: 您的患者

# no_patients_linked
source: No patients linked yet.
ms: Tiada pesakit dipautkan lagi.
zh: 暂无关联患者。

# invite_instructions
source: Patients can invite you using your email.
ms: Pesakit boleh menjemput anda menggunakan e-mel anda.
zh: 患者可以使用您的电子邮件邀请您。

# sharing_health_data
source: Wants to share their health data
ms: Ingin berkongsi data kesihatan mereka
zh: 想要分享他们的健康数据

# adherence_label
source: Adherence
ms: Pematuhan
zh: 依从性

# adherence_good
source: Good
ms: Baik
zh: 良好

# health_academy_title
source: Health Academy
ms: Akademi Kesihatan
zh: 健康学院

# insulin_pen_title
source: How to Use Insulin Pen
ms: Cara Penggunaan Insulin Pen
zh: 胰岛素笔使用方法

# insulin_pen_desc
source: Official MOH guide on correct insulin injection technique.
ms: Panduan rasmi KKM tentang teknik suntikan insulin yang betul.
zh: 卫生部关于正确胰岛素注射技术的官方指南。

# inhaler_technique_title
source: Inhaler Technique (MDI)
ms: Teknik Inhaler (MDI)
zh: 吸入器使用技巧 (MDI)

# inhaler_technique_desc
source: How to use an inhaler for asthma correctly.
ms: Cara menggunakan inhaler untuk asma dengan betul.
zh: 如何正确使用哮喘吸入器。

# know_warfarin_title
source: Know Your Warfarin
ms: Kenali Ubat Warfarin
zh: 认识华法林 (Warfarin)

# know_warfarin_desc
source: Contraindications and important info for heart patients.
ms: Pantang larang dan info penting bagi pesakit jantung.
zh: 心脏病患者的禁忌和重要信息。

# hypoglycemia_signs_title
source: Signs of Hypoglycemia
ms: Tanda-tanda Hipoglisemia
zh: 低血糖症状

# hypoglycemia_signs_desc
source: What to do if your blood sugar is too low?
ms: Apa perlu buat jika gula darah anda terlalu rendah?
zh: 如果您的血糖过低该怎么办？

# official_missed_dose_protocol_title
source: Official Missed Dose Protocol
ms: Protokol Rasmi Dos Terlepas
zh: 官方漏服药物方案

# official_missed_dose_protocol_desc
source: What to do if you or the person you care for misses a dose.
ms: Apa yang perlu dilakukan jika anda atau orang yang anda jaga terlepas dos.
zh: 如果您或您照顾的人漏服药物该怎么办。

# know_your_medicine_title
source: Know Your Medicine
ms: Kenali Ubat
zh: 了解您的药物

# know_your_medicine_desc
source: General tips for safe medication intake.
ms: Tips umum pengambilan ubat yang selamat.
zh: 安全服药的一般提示。

source: Expert Clinical Analysis
ms: Analisis Klinikal Pakar
zh: 专家临床分析

# clinical_analysis_desc
source: AI-powered summary of your medication adherence and health vitals history.
ms: Ringkasan dikuasakan AI tentang sejarah pematuhan ubat dan vital kesihatan anda.
zh: AI 驱动的用药依从性和生命体征历史摘要。

source: Precision Adherence Tracking
ms: Penjejakan Pematuhan Ketepatan
zh: 精确依从性追踪

# health_vital_readings_desc
source: Health Vital Readings (BP, Sugar)
ms: Bacaan Vital Kesihatan (Tekanan Darah, Gula)
zh: 健康生命体征读数（血压、血糖）

# ai_clinician_insights
source: AI Clinician Pattern Insights
ms: Cerapan Corak Pakar Klinikal AI
zh: AI 临床医生模式洞察
